# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]], #2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]], #4
   [-2, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]], #6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]], #8
   [-1, 1, SPPF, [1024, 5]],  # 9
   [4, 1, CBAM, [128]], ##cbam block #10
   [6, 1, CBAM, [256]], ##cbam block #11
  ]

# YOLOv5 v6.0 head
head:
  [[9, 1, Conv, [512, 1, 1]], #12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #13
   [[-1, 11], 1, Concat, [1]],  # cat backbone P4 #14 #from cbam 11
   [-1, 3, C3, [512, False]],  # 15

   [-1, 1, Conv, [256, 1, 1]], #16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #17
   [[-1, 10], 1, Concat, [1]],  # cat backbone P3 #18 #from cbam 10
   [-1, 3, C3, [256, False]],  # 19 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], #20
   [[-1, 16], 1, Concat, [1]],  # cat head P4 #21
   [-1, 3, C3, [512, False]],  # 22 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], #23
   [[-1, 12], 1, Concat, [1]],  # cat head P5 #24
   [-1, 3, C3, [1024, False]],  # 25 (P5/32-large)

   [[19, 22, 25], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
